Repository: sta1r/dotmailer-wordpress-plugin
Catalog: languages/hackweek-*.po
Languages: el

source: Subscribe to our newsletter
el: Εγγραφείτε στο newsletter μας

source: Please use a valid email address
el: Παρακαλώ χρησιμοποιήστε μια έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου

source: Please fill all the required fields
el: Παρακαλώ συμπληρώστε όλα τα απαιτούμενα πεδία

source: Please select one newsletter
el: Παρακαλώ επιλέξτε ένα ενημερωτικό δελτίο

source: You have now subscribed to our newsletter
el: Τώρα έχετε εγγραφεί στο newsletter μας

source: There was a problem signing you up.
el: Υπήρχε πρόβλημα με την υπογραφή σου.

source: Subscribe
el: Εγγραφή

source: Put a signup form on your WordPress Website
el: Βάλτε μια φόρμα εγγραφής στην ιστοσελίδα σας WordPress

source: dotmailer Sign-up Form
el: Φόρμα εγγραφής dotMailer

source: Please complete the fields below:
el: Παρακαλούμε συμπληρώστε τα παρακάτω πεδία:

source: Your email address*:
el: Παρακαλώ χρησιμοποιήστε μια έγκυρη διεύθυνση ηλεκτρονικού ταχυδρομείου

source: dd-block - Dotdigital Block
el: DD-Block-Dotdigital μπλοκ

source: dd-block — Dotdigital Block
el: DD-Block-Dotdigital μπλοκ

source: CGB Example
el: CGB παράδειγμα

source: create-guten-block
el: DD-Block-Dotdigital μπλοκ

source: Select a survey:
el: Επιλέξτε μια έρευνα:
